import { useParams } from "react-router-dom";
import { useNavigate } from "react-router-dom";
import { Card, CardContent, CardMedia, Typography, Button, Container } from "@mui/material";
import ArrowBackIcon from "@mui/icons-material/ArrowBack";

const Soildata = () => {
  const { id } = useParams(); // รับ id จาก URL
  const soilData = [
    {
      name: "ชุดดินที่ 1: ชุดดินบ้านจอง",
      description: "ดินร่วนปนดินเหนียว มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่ เช่น ข้าวโพด ลิ้นจี่",
      province: "เชียงใหม่",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (1).png"
    },
    {
      name: "ชุดดินที่ 2: ชุดดินบ้อไทย",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "อุดรธานี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (2).png"
    },
    {
      name: "ชุดดินที่ 3: ชุดดินบ้านโภชน์",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่ เช่น อ้อย มันสำปะหลัง",
      province: "เพชรบูรณ์",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (3).png"
    },
    {
      name: "ชุดดินที่ 4: ชุดดินเชียงแสน",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกข้าวและพืชสวน",
      province: "เชียงราย",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (4).png"
    },
    {
      name: "ชุดดินที่ 5: ชุดดินเชียงของ",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "เชียงราย",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (5).png"
    },
    {
      name: "ชุดดินที่ 6: ชุดดินเชียงใหม่",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "เชียงใหม่",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (6).png"
    },
    {
      name: "ชุดดินที่ 7: ชุดดินดงยางเอน",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่ เช่น ข้าวโพด ถั่วเหลือง",
      province: "ขอนแก่น",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (7).png"
    },
    {
      name: "ชุดดินที่ 8: ชุดดินดอยปุย",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "เชียงใหม่",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (8).png"
    },
    {
      name: "ชุดดินที่ 9: ชุดดินห้างฉัตร",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "ลำปาง",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (9).png"
    },
    {
      name: "ชุดดินที่ 10: ชุดดินกำแพงเพชร",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชไร่ เช่น อ้อย มันสำปะหลัง",
      province: "กำแพงเพชร",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (10).png"
    },
    {
      name: "ชุดดินที่ 11: ชุดดินโกรกพระ",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่ เช่น ข้าวโพด ถั่วเหลือง",
      province: "นครสวรรค์",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (11).png"
    },
    {
      name: "ชุดดินที่ 12: ชุดดินหล่มสัก",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "เพชรบูรณ์",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (12).png"
    },
    {
      name: "ชุดดินที่ 13: ชุดดินลับแล",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกไม้ผล เช่น ลำไย ลิ้นจี่",
      province: "อุตรดิตถ์",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (13).png"
    },
    {
      name: "ชุดดินที่ 14: ชุดดินลี้",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "ลำพูน",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (14).png"
    },
    {
      name: "ชุดดินที่ 15: ชุดดินลำปาง",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "ลำปาง",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (15).png"
    },
    {
      name: "ชุดดินที่ 16: ชุดดินแม่อิง",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่ เช่น ข้าวโพด ถั่วเหลือง",
      province: "เชียงราย",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (16).png"
    },
    {
      name: "ชุดดินที่ 17: ชุดดินแม่ขาน",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "เชียงใหม่",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (17).png"
    },
    {
      name: "ชุดดินที่ 18: ชุดดินแม่สาย",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "เชียงราย",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (18).png"
    },
    {
      name: "ชุดดินที่ 19: ชุดดินแม่แตง",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกไม้ผล เช่น ลำไย ลิ้นจี่",
      province: "เชียงใหม่",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (19).png"
    },
    {
      name: "ชุดดินที่ 20: ชุดดินแม่ทะ",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "ลำปาง",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (20).png"
    },
    {
      name: "ชุดดินที่ 21: ชุดดินน่าน",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่ เช่น ข้าวโพด ถั่วเหลือง",
      province: "น่าน",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (21).png"
    },
    {
      name: "ชุดดินที่ 22: ชุดดินหนองมด",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "อุบลราชธานี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (22).png"
    },
    {
      name: "ชุดดินที่ 23: ชุดดินงาว",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "ลำปาง",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (23).png"
    },
    {
      name: "ชุดดินที่ 24: ชุดดินพะเยา",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกไม้ผล เช่น ลำไย ลิ้นจี่",
      province: "พะเยา",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (24).png"
    },
    {
      name: "ชุดดินที่ 25: ชุดดินเพชรบูรณ์",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่ เช่น อ้อย มันสำปะหลัง",
      province: "เพชรบูรณ์",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (25).png"
    },
    {
      name: "ชุดดินที่ 26: ชุดดินไพศาลี",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "นครสวรรค์",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (26).png"
    },
    {
      name: "ชุดดินที่ 27: ชุดดินโป่งตอง",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่ เช่น ข้าวโพด ถั่วเหลือง",
      province: "แม่ฮ่องสอน",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (27).png"
    },
    {
      name: "ชุดดินที่ 28: ชุดดินพิจิตร",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "พิจิตร",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (28).png"
    },
    {
      name: "ชุดดินที่ 29: ชุดดินแพร่",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "แพร่",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (29).png"
    },
    {
      name: "ชุดดินที่ 30: ชุดดินสันทราย",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกไม้ผล เช่น ลำไย ลิ้นจี่",
      province: "เชียงใหม่",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (30).png"
    },
    {
      name: "ชุดดินที่ 31: ชุดดินโทรงาม",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "นครราชสีมา",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (31).png"
    },
    {
      name: "ชุดดินที่ 32: ชุดดินศรีสัชนาลัย",
      description: "ดินเหนียวปนทรายแป้ง มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "สุโขทัย",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (32).png"
    },
    {
      name: "ชุดดินที่ 33: ชุดดินสบปราบ",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่ เช่น ข้าวโพด ถั่วเหลือง",
      province: "ลำปาง",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (33).png"
    },
    {
      name: "ชุดดินที่ 34: ชุดดินสันป่าตอง",
      description: "ดินร่วนปนทรายร่วน มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกไม้ผล เช่น ลำไย ลิ้นจี่",
      province: "เชียงใหม่",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (34).png"
    },
    {
      name: "ชุดดินที่ 35: ชุดดินท่าพล",
      description: "ดินเหนียวปนทรายแป้ง มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "พิษณุโลก",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (35).png"
    },
    {
      name: "ชุดดินที่ 36: ชุดดินตะพานหิน",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชไร่ เช่น อ้อย มันสำปะหลัง",
      province: "พิจิตร",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (36).png"
    },
    {
      name: "ชุดดินที่ 37: ชุดดินอุตรดิตถ์",
      description: "ดินร่วนเหนียวปนทรายแป้งสีน้ำตาล มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "อุตรดิตถ์",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (37).png"
    },
    {
      name: "ชุดดินที่ 38: ชุดดินวิเชียรบุรี",
      description: "ดินทรายปูนดินร่วน มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกไม้ผล เช่น ลำไย ลิ้นจี่",
      province: "เพชรบูรณ์",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (38).png"
    },
    {
      name: "ชุดดินที่ 39: ชุดดินเวียงชัย",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "เชียงราย",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (39).png"
    },
    {
      name: "ชุดดินที่ 40: ชุดดินบ้านไร่",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชไร่ เช่น อ้อย มันสำปะหลัง",
      province: "อุทัยธานี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (40).png"
    },
    {
      name: "ชุดดินที่ 41: ชุดดินบ้านหมี่",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่ เช่น ข้าวโพด ถั่วเหลือง",
      province: "ลพบุรี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (41).png"
    },
    {
      name: "ชุดดินที่ 42: ชุดดินชัยนาท",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "ชัยนาท",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (42).png"
    },
    {
      name: "ชุดดินที่ 43: ชุดดินเดิมบาง",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "สุพรรณบุรี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (43).png"
    },
    {
      name: "ชุดดินที่ 44: ชุดดินโคกกระเทียม",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกไม้ผล เช่น ลำไย ลิ้นจี่",
      province: "ลพบุรี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (44).png"
    },
    {
      name: "ชุดดินที่ 45: ชุดดินกำแพงแสน",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่ เช่น อ้อย มันสำปะหลัง",
      province: "นครปฐม",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (45).png"
    },
    {
      name: "ชุดดินที่ 46: ชุดดินเขาพลอง",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "ลพบุรี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (46).png"
    },
    {
      name: "ชุดดินที่ 47: ชุดดินโคกสำโรง",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "ลพบุรี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (47).png"
    },
    {
      name: "ชุดดินที่ 48: ชุดดินเขาย้อย",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกไม้ผล เช่น ลำไย ลิ้นจี่",
      province: "เพชรบุรี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (48).png"
    },
    {
      name: "ชุดดินที่ 49: ชุดดินลพบุรี",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "ลพบุรี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (49).png"
    },
    {
      name: "ชุดดินที่ 50: ชุดดินลำสนธิ",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "ลพบุรี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (50).png"
    },
    {
      name: "ชุดดินที่ 51: ชุดดินลานสัก",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "อุทัยธานี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (51).png"
    },
    {
      name: "ชุดดินที่ 52: ชุดดินมโนรมย์",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกไม้ผล เช่น ลำไย ลิ้นจี่",
      province: "ชัยนาท",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (52).png"
    },
    {
      name: "ชุดดินที่ 53: ชุดดินนครปฐม",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "นครปฐม",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (53).png"
    },
    {
      name: "ชุดดินที่ 54: ชุดดินเพชรบุรี",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "เพชรบุรี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (54).png"
    },
    {
      name: "ชุดดินที่ 55: ชุดดินดินปากท่อ",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "ราชบุรี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (55).png"
    },
    {
      name: "ชุดดินที่ 56: ชุดดินราชบุรี",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกไม้ผล เช่น ลำไย ลิ้นจี่",
      province: "ราชบุรี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (56).png"
    },
    {
      name: "ชุดดินที่ 57: ชุดดินสระบุรี",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "สระบุรี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (57).png"
    },
    {
      name: "ชุดดินที่ 58: ชุดดินทับเสลา",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "สระบุรี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (58).png"
    },
    {
      name: "ชุดดินที่ 59: ชุดดินท่าเรือ",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "พระนครศรีอยุธยา",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (59).png"
    },
    {
      name: "ชุดดินที่ 60: ชุดดินทับกวาง",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกไม้ผล เช่น ลำไย ลิ้นจี่",
      province: "สระบุรี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (60).png"
    },
    {
      name: "ชุดดินที่ 61: ชุดดินอุทัยธานี",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "อุทัยธานี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (61).png"
    },
    {
      name: "ชุดดินที่ 62: ชุดดินกันทรวิชัย",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "มหาสารคาม",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (62).png"
    },
    {
      name: "ชุดดินที่ 63: ชุดดินศรีสงคราม",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "นครพนม",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (63).png"
    },
    {
      name: "ชุดดินที่ 64: ชุดดินท่าตูม",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกไม้ผล เช่น ลำไย ลิ้นจี่",
      province: "สุรินทร์",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (64).png"
    },
    {
      name: "ชุดดินที่ 65: ชุดดินนครพรม",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "นครพนม",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (65).png"
    },
    {
      name: "ชุดดินที่ 66: ชุดดินชุมแพ",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "ขอนแก่น",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (66).png"
    },
    {
      name: "ชุดดินที่ 67: ชุดดินร้อยเอ็ด",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "ร้อยเอ็ด",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (67).png"
    },
    {
      name: "ชุดดินที่ 68: ชุดดินร้อยเอ็ด",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกไม้ผล เช่น ลำไย ลิ้นจี่",
      province: "ร้อยเอ็ด",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (68).png"
    },
    {
      name: "ชุดดินที่ 69: ชุดดินบุณฑริก",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "อุบลราชธานี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (69).png"
    },
    {
      name: "ชุดดินที่ 70: ชุดดินอุบล",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "อุบลราชธานี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (70).png"
    },
    {
      name: "ชุดดินที่ 71: ชุดดินชำนิ",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "บุรีรัมย์",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (71).png"
    },
    {
      name: "ชุดดินที่ 72: ชุดดินดินพล",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกไม้ผล เช่น ลำไย ลิ้นจี่",
      province: "นครราชสีมา",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (72).png"
    },
    {
      name: "ชุดดินที่ 73: ชุดดินเขมราฐ",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "อุบลราชธานี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (73).png"
    },
    {
      name: "ชุดดินที่ 74: ชุดดินนาดูน",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "มหาสารคาม",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (74).png"
    },
    {
      name: "ชุดดินที่ 75: ชุดดินปลาปาก",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "นครพนม",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (75).png"
    },
    {
      name: "ชุดดินที่ 76: ชุดดินโนนไทย",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกไม้ผล เช่น ลำไย ลิ้นจี่",
      province: "นครราชสีมา",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (76).png"
    },
    {
      name: "ชุดดินที่ 77: ชุดดินบุรีรัมย์",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "บุรีรัมย์",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (77).png"
    },
    {
      name: "ชุดดินที่ 78: ชุดดินชุมพลบุรี",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "สุรินทร์",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (78).png"
    },
    {
      name: "ชุดดินที่ 79: ชุดดินธาตุพนม",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "นครพนม",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (79).png"
    },
    {
      name: "ชุดดินที่ 80: ชุดดินท่าอุเทน",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกไม้ผล เช่น ลำไย ลิ้นจี่",
      province: "นครพนม",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (80).png"
    },
    {
      name: "ชุดดินที่ 81: ชุดดินจันทึก",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "นครราชสีมา",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (81).png"
    },
    {
      name: "ชุดดินที่ 82: ชุดดินน้ำพอง",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "ขอนแก่น",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (82).png"
    },
    {
      name: "ชุดดินที่ 83: ชุดดินมหาสารคาม",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "มหาสารคาม",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (83).png"
    },
    {
      name: "ชุดดินที่ 84: ชุดดินบ้านไผ่",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกไม้ผล เช่น ลำไย ลิ้นจี่",
      province: "ขอนแก่น",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (84).png"
    },
    {
      name: "ชุดดินที่ 85: ชุดดินห้วยแถลง",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "นครราชสีมา",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (85).png"
    },
    {
      name: "ชุดดินที่ 86: ชุดดินโคราช",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "นครราชสีมา",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (86).png"
    },
    {
      name: "ชุดดินที่ 87: ชุดดินจอมพระ",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "สุรินทร์",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (87).png"
    },
    {
      name: "ชุดดินที่ 88: ชุดดินปักธงชัย",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกไม้ผล เช่น ลำไย ลิ้นจี่",
      province: "นครราชสีมา",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (88).png"
    },
    {
      name: "ชุดดินที่ 89: ชุดดินยางตลาด",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "กาฬสินธุ์",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (89).png"
    },
    {
      name: "ชุดดินที่ 90: ชุดดินวาริน",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "อุบลราชธานี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (90).png"
    },
    {
      name: "ชุดดินที่ 91: ชุดดินยโสธร",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "ยโสธร",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (91).png"
    },
    {
      name: "ชุดดินที่ 92: ชุดดินชุมพวง",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกไม้ผล เช่น ลำไย ลิ้นจี่",
      province: "นครราชสีมา",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (92).png"
    },
    {
      name: "ชุดดินที่ 93: ชุดดินสีคิ้ว",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "นครราชสีมา",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (93).png"
    },
    {
      name: "ชุดดินที่ 94: ชุดดินด้านซ้าย",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "อุบลราชธานี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (94).png"
    },
    {
      name: "ชุดดินที่ 95: ชุดดินโพนพิสัย",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "หนองคาย",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (95).png"
    },
    {
      name: "ชุดดินที่ 96: ชุดดินเชียงคาน",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกไม้ผล เช่น ลำไย ลิ้นจี่",
      province: "เลย",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (96).png"
    },
    {
      name: "ชุดดินที่ 97: ชุดดินสูงเนิน",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "นครราชสีมา",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (97).png"
    },
    {
      name: "ชุดดินที่ 98: ชุดดินโชคชัย",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "นครราชสีมา",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (98).png"
    },
    {
      name: "ชุดดินที่ 99: ชุดดินดินเลย",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "เลย",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (99).png"
    },
    {
      name: "ชุดดินที่ 100: ชุดดินจัตุรัส",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกไม้ผล เช่น ลำไย ลิ้นจี่",
      province: "ชัยภูมิ",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (100).png"
    },
    {
      name: "ชุดดินที่ 101: ชุดดินวังสะพุง",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่ เช่น ข้าวโพด ถั่วเหลือง",
      province: "เลย",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (101).png"
    },
    {
      name: "ชุดดินที่ 102: ชุดดินอรัญประเทศ",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "สระแก้ว",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (102).png"
    },
    {
      name: "ชุดดินที่ 103: ชุดดินบ้านบึง",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "ชลบุรี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (103).png"
    },
    {
      name: "ชุดดินที่ 104: ชุดดินบ้านฉาง",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกไม้ผล เช่น ลำไย ลิ้นจี่",
      province: "ระยอง",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (104).png"
    },
    {
      name: "ชุดดินที่ 105: ชุดดินบ้านค่าย",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่ เช่น อ้อย มันสำปะหลัง",
      province: "ระยอง",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (105).png"
    },
    {
      name: "ชุดดินที่ 106: ชุดดินบึงชะมง",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "ฉะเชิงเทรา",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (106).png"
    },
    {
      name: "ชุดดินที่ 107: ชุดดินชลบุรี",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่ เช่น ข้าวโพด ถั่วเหลือง",
      province: "ชลบุรี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (107).png"
    },
    {
      name: "ชุดดินที่ 108: ชุดดินกบินทร์บุรี",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "ปราจีนบุรี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (108).png"
    },
    {
      name: "ชุดดินที่ 109: ชุดดินคลองขาก",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "ฉะเชิงเทรา",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (109).png"
    },
    {
      name: "ชุดดินที่ 110: ชุดดินแกลง",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกไม้ผล เช่น ลำไย ลิ้นจี่",
      province: "ระยอง",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (110).png"
    },
    {
      name: "ชุดดินที่ 111: ชุดดินมะขาม",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "จันทบุรี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (111).png"
    },
    {
      name: "ชุดดินที่ 112: ชุดดินหนองบอน",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "ตราด",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (112).png"
    },
    {
      name: "ชุดดินที่ 113: ชุดดินโอลำเจียก",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่ เช่น ข้าวโพด ถั่วเหลือง",
      province: "ระยอง",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (113).png"
    },
    {
      name: "ชุดดินที่ 114: ชุดดินโป่งน้ำร้อน",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกไม้ผล เช่น ลำไย ลิ้นจี่",
      province: "จันทบุรี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (114).png"
    },
    {
      name: "ชุดดินที่ 115: ชุดดินพานทอง",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "ชลบุรี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (115).png"
    },
    {
      name: "ชุดดินที่ 116: ชุดดินพัทยา",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "ชลบุรี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (116).png"
    },
    {
      name: "ชุดดินที่ 117: ชุดดินระยอง",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "ระยอง",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (117).png"
    },
    {
      name: "ชุดดินที่ 118: ชุดดินสัตหีบ",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกไม้ผล เช่น ลำไย ลิ้นจี่",
      province: "ชลบุรี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (118).png"
    },
    {
      name: "ชุดดินที่ 119: ชุดดินสระแก้ว",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "สระแก้ว",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (119).png"
    },
    {
      name: "ชุดดินที่ 120: ชุดดินศรีราชา",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "ชลบุรี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (120).png"
    },
    {
      name: "ชุดดินที่ 121: ชุดดินตราด",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "ตราด",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (121).png"
    },
    {
      name: "ชุดดินที่ 122: ชุดดินท่าใหม่",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกไม้ผล เช่น ลำไย ลิ้นจี่",
      province: "จันทบุรี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (122).png"
    },
    {
      name: "ชุดดินที่ 123: ชุดดินอ่าวลึก",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "กระบี่",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (123).png"
    },
    {
      name: "ชุดดินที่ 124: ชุดดินชุมพร",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "ชุมพร",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (124).png"
    },
    {
      name: "ชุดดินที่ 125: ชุดดินไชยา",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "สุราษฎร์ธานี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (125).png"
    },
    {
      name: "ชุดดินที่ 126: ชุดดินฝั่งแดน",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกไม้ผล เช่น ลำไย ลิ้นจี่",
      province: "สุราษฎร์ธานี",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (126).png"
    },
    {
      name: "ชุดดินที่ 127: ชุดดินกันตัง",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "ตรัง",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (127).png"
    },
    {
      name: "ชุดดินที่ 128: ชุดดินควนกาหลง",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "สตูล",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (128).png"
    },
    {
      name: "ชุดดินที่ 129: ชุดดินเขาขาด",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "กระบี่",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (129).png"
    },
    {
      name: "ชุดดินที่ 130: ชุดดินคลองท่อม",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกไม้ผล เช่น ลำไย ลิ้นจี่",
      province: "กระบี่",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (130).png"
    },
    {
      name: "ชุดดินที่ 131: ชุดดินเกาะใหญ่",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "พังงา",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (131).png"
    },
    {
      name: "ชุดดินที่ 132: ชุดดินคลองขุด",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "กระบี่",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (132).png"
    },
    {
      name: "ชุดดินที่ 133: ชุดดินนาทอน",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "สตูล",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (133).png"
    },
    {
      name: "ชุดดินที่ 134: ชุดดินระโนด",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกไม้ผล เช่น ลำไย ลิ้นจี่",
      province: "สงขลา",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (134).png"
    },
    {
      name: "ชุดดินที่ 135: ชุดดินสงขลา",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "สงขลา",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (135).png"
    },
    {
      name: "ชุดดินที่ 136: ชุดดินสตูล",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "สตูล",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (136).png"
    },
    {
      name: "ชุดดินที่ 137: ชุดดินสวี",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "ชุมพร",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (137).png"
    },
    {
      name: "ชุดดินที่ 138: ชุดดินแซะ",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกไม้ผล เช่น ลำไย ลิ้นจี่",
      province: "ชุมพร",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (138).png"
    },
    {
      name: "ชุดดินที่ 139: ชุดดินศาลา",
      description: "ดินร่วนเหนียวปนทรายแป้ง มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "ชุมพร",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (139).png"
    },
    {
      name: "ชุดดินที่ 140: ชุดดินทุ่งค่าย",
      description: "ดินร่วนปนทราย มีความอุดมสมบูรณ์ปานกลาง เหมาะสำหรับปลูกพืชสวนและไม้ผล",
      province: "ชุมพร",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (140).png"
    },
    {
      name: "ชุดดินที่ 141: ชุดดินวิสัย",
      description: "ดินร่วนปนทราย มีการระบายน้ำดี เหมาะสำหรับปลูกพืชไร่และพืชสวน",
      province: "ชุมพร",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (141).png"
    },
    {
      name: "ชุดดินที่ 142: ชุดดินวังตง",
      description: "ดินร่วนปนทรายแป้ง มีความอุดมสมบูรณ์สูง เหมาะสำหรับปลูกไม้ผล เช่น ลำไย ลิ้นจี่",
      province: "ชุมพร",
      image: "/images/142ชุดดิน-14-10-2022_soildataset (142).png"
    }
  ];

  const soil = soilData[id]; // ใช้ id เพื่อค้นหาชุดดินที่เลือก
  const navigate = useNavigate();
  const handleCancel = () => {
    navigate(-1); // ย้อนกลับไปยังหน้าก่อนหน้า
  };

  return (
    <Container sx={{ py: 4 }}>
      <Button
        startIcon={<ArrowBackIcon />}
        onClick={handleCancel}
        sx={{
          color: "#38b000",
          fontWeight: "bold",
          textTransform: "none",
          mb: 2,
          "&:hover": {
            backgroundColor: "rgba(56, 176, 0, 0.1)",
          },
        }}
      >
        ย้อนกลับ
      </Button>
      <Card
        sx={{
          maxWidth: 800,
          margin: "auto",
          boxShadow: 3,
          borderRadius: 2,
          overflow: "hidden",
        }}
      >
        <CardMedia
          component="img"
          image={soil.image}
          alt={soil.name}
          sx={{ width: "100%", height: "full", objectFit: "cover" }}
        />
        <CardContent sx={{ p: 4 }}>
          <Typography variant="h5" component="div" sx={{ mb: 2, fontWeight: "bold", color: "#2c3e50" }}>
            {soil.name}
          </Typography>
          <Typography variant="body1" color="text.secondary" sx={{ lineHeight: 1.6, fontSize: "1.1rem" }}>
            {soil.description}
          </Typography>
        </CardContent>
      </Card>
    </Container>
  );
};

export default Soildata;